### *Run below mentioned Commands in a code cell if these packages are not available in your environment*
* ! pip install pandas
* ! pip install matplotlib
* ! pip install os
* ! pip install datetime

### *Loading Libraries*

In [1]:
import pandas as pd
import os
import datetime

#### Import Sales Data

In [2]:
xlsx = pd.ExcelFile('Sales-Data.xlsx')
sheet_names = xlsx.sheet_names
sheet_names

['Customer-Base', 'Sales-Data']

In [3]:
sales_data = pd.read_excel('Sales-Data.xlsx', sheet_name= 'Sales-Data')
customer_base = pd.read_excel('Sales-Data.xlsx', sheet_name= 'Customer-Base')
display(sales_data.head(), customer_base.head())

  InvoiceDate   InvoiceID CustomerID  InvoiceValue
0  2022-01-01  DYSMJ47747  WNYQN5037            85
1  2022-01-01  JDOBV42881  GJMJI5215            87
2  2022-01-01  IWATI93376  AWXSL7355            76
3  2022-01-01  BYIGR33509  TTPXB4921            56
4  2022-01-01  KEQKA35598  WQYYR7437            84

   ID        CID Gender  Age  PinCode
0   1  NCHFA9510      M   31   201303
1   2  BUUVH1506      M   33   201301
2   3  DYWQP6900      F   34   201302
3   4  DFQSR6753      M   41   201303
4   5  LZIEQ1426      M   38   201301

In [4]:
display(sales_data.shape)
master = sales_data.merge(customer_base, how = 'left', left_on = 'CustomerID', right_on= 'CID')
display(master.shape)
master.head()

(74988, 4)

(74988, 9)

,InvoiceDate,InvoiceID,CustomerID,InvoiceValue,ID,CID,Gender,Age,PinCode
0,2022-01-01,DYSMJ47747,WNYQN5037,85,20,WNYQN5037,M,26,201303
1,2022-01-01,JDOBV42881,GJMJI5215,87,96,GJMJI5215,M,50,201305
2,2022-01-01,IWATI93376,AWXSL7355,76,25,AWXSL7355,M,41,201305
3,2022-01-01,BYIGR33509,TTPXB4921,56,19,TTPXB4921,F,26,201301
4,2022-01-01,KEQKA35598,WQYYR7437,84,55,WQYYR7437,M,42,201302

In [5]:
### Which day of the year company made maximum revenue?
daily_sales = master.groupby('InvoiceDate').aggregate(daily_Sale = ('InvoiceValue', sum)).reset_index()
maximumsale = daily_sales.daily_Sale.max()
display(maximumsale)
daily_sales[(daily_sales['daily_Sale'] == maximumsale)]

90960

    InvoiceDate  daily_Sale
352  2022-12-19       90960

In [6]:
### What is mean sale per day?
import numpy as np
mean_sales = master.groupby('InvoiceDate').aggregate(Daily_Sale = ('InvoiceValue', np.mean)).reset_index()
mean_sales.head()

  InvoiceDate  Daily_Sale
0  2022-01-01   53.266055
1  2022-01-02   52.125000
2  2022-01-03   55.606061
3  2022-01-04   51.000000
4  2022-01-05   55.417840

In [9]:
### Organization want to implement a new HR policy in which Zone Manager (Zip is considered as Zone) can grant leaves to employee when business inflow is a bit low. What are those days in different months?
master['Month'] = master.InvoiceDate.apply(lambda x : x.strftime('%b'))
master['Day'] = master.InvoiceDate.apply(lambda x : x.strftime('%a'))

minimum_sale_by_day = master.pivot_table(index='Month', 
                                            columns='Day', 
                                            values=['InvoiceValue'], 
                                            aggfunc={'InvoiceValue': 'sum'}, 
                                            fill_value=0)
minimum_sale_by_day

      InvoiceValue
Day            Fri     Mon     Sat     Sun     Thu     Tue     Wed
Month
Apr         100554   79360   93496   80283   75797   77225   77083
Aug         156695  188531  167863  152387  152097  175489  181067
Dec         387116  318463  381463  296884  380098  309909  318326
Feb          53508   56637   58529   56361   58267   55768   56869
Jan          44723   57581   57215   55904   44921   48480   44981
Jul         165661  133568  159309  166883  129177  136400  130580
Jun         109540   95965  107511  101060  129472   97150  130250
Mar          68464   67765   72951   70122   82180   83532   88454
May          92013  105556   96971  116875   89911  112492   84053
Nov         252587  281378  263839  272728  278956  312648  333469
Oct         221061  273707  260160  271276  214855  207130  217979
Sep         222501  171839  185091  174669  223436  185648  177120

In [19]:
### What is Median invoice genration rate per month?
invoice_generation = master.groupby('InvoiceDate').aggregate(Daily_Count = ('InvoiceValue', 'count')).reset_index()
display(invoice_generation['Daily_Count'].median(), invoice_generation['Daily_Count'].mean())

206.0

205.44657534246576

In [23]:
### what is average invoice value in 2022? What is trend over month-on-month?
display(master.InvoiceValue.mean())
average_Revenue_generation = master.groupby('InvoiceDate').aggregate(Daily_Count = ('InvoiceValue', np.mean)).reset_index()
average_Revenue_generation.head()

172.372539606337

  InvoiceDate  Daily_Count
0  2022-01-01    53.266055
1  2022-01-02    52.125000
2  2022-01-03    55.606061
3  2022-01-04    51.000000
4  2022-01-05    55.417840

In [24]:
master.head()

,InvoiceDate,InvoiceID,CustomerID,InvoiceValue,ID,CID,Gender,Age,PinCode,Month,Day
0,2022-01-01,DYSMJ47747,WNYQN5037,85,20,WNYQN5037,M,26,201303,Jan,Sat
1,2022-01-01,JDOBV42881,GJMJI5215,87,96,GJMJI5215,M,50,201305,Jan,Sat
2,2022-01-01,IWATI93376,AWXSL7355,76,25,AWXSL7355,M,41,201305,Jan,Sat
3,2022-01-01,BYIGR33509,TTPXB4921,56,19,TTPXB4921,F,26,201301,Jan,Sat
4,2022-01-01,KEQKA35598,WQYYR7437,84,55,WQYYR7437,M,42,201302,Jan,Sat

In [32]:
### which pincode has generated maximum revenue in June-2023? Do the same pincode have best revenue/invoice?
monthly_sale_by_pin = master.pivot_table(index='Month', 
                                            columns='PinCode', 
                                            values=['InvoiceValue'], 
                                            aggfunc={'InvoiceValue': 'sum'}, 
                                            fill_value=0)

monthly_sale_by_pin

        InvoiceValue
PinCode       201301  201302  201303  201304  201305
Month
Apr           108315  120807  142851   97462  114363
Aug           209557  230208  284152  185070  265142
Dec           442404  482856  599385  361458  506156
Feb            74745   77110   97465   67257   79362
Jan            64926   69530   90721   55096   73532
Jul           182377  207068  261240  155517  215376
Jun           139269  152309  188645  124228  166497
Mar            96085  106029  130940   89125  111289
May           126423  141541  173339  108517  148051
Nov           349397  401470  482501  317853  444384
Oct           294530  344673  416872  258919  351174
Sep           248062  263506  337650  220460  270626

In [36]:
monthly_sale_by_pin[monthly_sale_by_pin.index == 'Jun'].reset_index()

        Month InvoiceValue
PinCode             201301  201302  201303  201304  201305
0         Jun       139269  152309  188645  124228  166497